[
  {
    "title": "The Smiths",
    "yearRecorded": "1983",
    "releaseDate": "1984-02-20",
    "releaseYear": 1984,
    "lengthSeconds": 2575,
    "lengthMinutes": "42:55",
    "genre": "Alternative Rock",
    "albumType": "Studio",
    "label": "Rough Trade Records",
    "ukChartPosition": 2,
    "ukGold": true,
    "ukPlatinum": false,
    "usGold": false,
    "songs": ["Reel Around The Fountain", "You've Got Everything Now", "Miserable Lie", "Pretty Girls Make Graves", "The Hand That Rocks The Cradle", "This Charming Man", "Still Ill", "Hand In Glove", "What Difference Does It Make?", "I Don't Owe You Anything", "Suffer Little Children"],
    "review": "'Arriving in an era dominated by synth pop and gloomy post-punk, the Smiths' eponymous debut was the bracing beginning of a new era. On the surface, the Smiths' sound wasn't radically different from traditional British guitar pop -- Johnny Marr's ringing, layered guitars were catchy and melodic -- but it was actually an astonishing subversion of the form, turning the structure inside out. Very few of the songs followed conventional verse-chorus structure, yet they were quite melodic within their own right. Marr's inventive songwriting was made all the more original and innovative by Morrissey's crooning and lyrics. Writing about unconventional topics, from homosexuality ('Hand in Glove') to child molestation and murder, Morrissey had a distinctively ironic, witty, and literate viewpoint whose strangeness was accentuated by his off-kilter voice, which would move from a croon to a yelp in a matter of seconds. While the production of 'The Smiths' is a little pristine, the songs are vital and alive, developing a new, unique voice within pop music. Though the Smiths continued to improve over the course of their career, their debut remains startling and exciting.' -- Stephen Thomas Erlewine",
    "img": "https://upload.wikimedia.org/wikipedia/en/1/13/The_Smiths_The_Smiths.jpg",
    "spotifyLink": "https://open.spotify.com/album/6cI1XoZsOhkyrCwtuI70CN?si=x3xKZujjStyyZevHKxof7g",
    "appleMusicLink": "https://music.apple.com/us/album/the-smiths/799995884"
  },
  {
    "title": "Meat Is Murder",
    "yearRecorded": "1984",
    "releaseDate": "1985-02-11",
    "releaseYear": 1985,
    "lengthSeconds": 2386,
    "lengthMinutes": "39:46",
    "genre": "Alternative Rock",
    "albumType": "Studio",
    "label": "Rough Trade Records",
    "ukChartPosition": 1,
    "ukGold": true,
    "ukPlatinum": false,
    "usGold": false,
    "songs": ["The Headmaster Ritual", "Rusholme Ruffians", "I Want The One I Can't Have", "What She Said", "That Joke Isn't Funny Anymore", "Nowhere Fast", "Well I Wonder", "Barbarism Begins At Home", "Meat Is Murder"],
    "review": "'With their second proper album 'Meat Is Murder', the Smiths begin to branch out and diversify, while refining the jangling guitar pop of their debut. In other words, it catches the group at a crossroads, unsure quite how to proceed. Taking the epic, layered 'How Soon Is Now?' as a starting point (the single, which is darker and more dance-oriented than the remainder of the album, was haphazardly inserted into the middle of the album for its American release), the group crafts more sweeping, mid-tempo numbers, whether it's the melancholy 'That Joke Isn't Funny Anymore' or the failed, self-absorbed protest of the title track. While the production is more detailed than before, the Smiths are at their best when they stick to their strengths -- 'The Headmaster Ritual' and 'I Want the One I Can't Have' are fine elaborations of the formula they laid out on the debut, while 'Rusholme Ruffians' is an infectious stab at rockabilly. However, the rest of 'Meat Is Murder' is muddled, repeating lyrical and musical ideas of before without significantly expanding them or offering enough hooks or melodies to make it the equal of 'The Smiths' or 'Hatful of Hollow.'' -- Stephen Thomas Erlewine",
    "img": "https://upload.wikimedia.org/wikipedia/en/b/b8/MeatMurder.jpg",
    "spotifyLink": "https://open.spotify.com/album/5DM1qCdgGt2zbknnsVn1Ca?si=XvmY7eanQcGSSbGiWKLGrw",
    "appleMusicLink": "https://music.apple.com/us/album/meat-is-murder/799986977"
  },
  {
    "title": "The Queen Is Dead",
    "yearRecorded": "1985",
    "releaseDate": "1986-06-16",
    "releaseYear": 1986,
    "lengthSeconds": 2208,
    "lengthMinutes": "36:48",
    "genre": "Alternative Rock",
    "albumType": "Studio",
    "label": "Rough Trade Records",
    "ukChartPosition": 2,
    "ukGold": true,
    "ukPlatinum": true,
    "usGold": true,
    "songs": ["The Queen Is Dead", "Frankly, Mr. Shankly", "I Know It's Over", "Never Had No One Ever", "Cemetry Gates", "Bigmouth Strikes Again", "The Boy With The Thorn In His Side", "Vicar In A Tutu", "There Is A Light That Never Goes Out", "Some Girls Are Bigger Than Others"],
    "review": "''Meat Is Murder' may have been a holding pattern, but 'The Queen Is Dead' is the Smiths' great leap forward, taking the band to new musical and lyrical heights. Opening with the storming title track, 'The Queen Is Dead' is a harder-rocking record than anything the Smiths had attempted before, but that's only on a relative scale -- although the backbeat is more pronounced, the group certainly doesn't rock in a conventional sense. Instead, Johnny Marr has created a dense web of guitars, alternating from the minor-key rush of 'Bigmouth Strikes Again' and the faux rockabilly of 'Vicar in a Tutu' to the bouncy acoustic pop of 'Cemetry Gates' and 'The Boy With the Thorn in His Side,' as well as the lovely melancholy of 'I Know It's Over' and 'There Is a Light That Never Goes Out.' And the rich musical bed provides Morrissey with the support for his finest set of lyrics. Shattering the myth that he is a self-pitying sap, Morrissey delivers a devastating set of clever, witty satires of British social mores, intellectualism, class, and even himself. He also crafts some of his finest, most affecting songs, particularly in the wistful 'The Boy With the Thorn in His Side' and the epic 'There Is a Light That Never Goes Out,' two masterpieces that provide the foundation for a remarkable album.' -- Stephen Thomas Erlewine",
    "img": "https://en.wikipedia.org/wiki/The_Queen_Is_Dead#/media/File:The-Queen-is-Dead-cover.png",
    "spotifyLink": "https://open.spotify.com/album/5Y0p2XCgRRIjna91aQE8q7?si=APMe4WCETZSv3c0A9es4iw",
    "appleMusicLink": "https://music.apple.com/us/album/the-queen-is-dead/800092985"
  },
  {
    "title": "Strangeways, Here We Come",
    "yearRecorded": "1987",
    "releaseDate": "1987-09-28",
    "releaseYear": 1987,
    "lengthSeconds": 2197,
    "lengthMinutes": "36:37",
    "genre": "Alternative Rock",
    "albumType": "Studio",
    "label": "Rough Trade Records",
    "ukChartPosition": 2,
    "ukGold": true,
    "ukPlatinum": false,
    "usGold": true,
    "songs": ["A Rush And A Push And The Land Is Ours", "I Started Something I Couldn't Finish", "Death Of A Disco Dancer", "Girlfriend In A Coma", "Stop Me If You Think You've Heard This One Before", "Last Night I Dreamt That Somebody Loved Me", "Unhappy Birthday", "Paint A Vulgar Picture", "Death At One's Elbow", "I Won't Share You"],
    "review": "'Recorded as the relationship between Morrissey and Johnny Marr was beginning to splinter, 'Strangeways, Here We Come' is the most carefully considered and elaborately produced album in the group's catalog. Though it aspires greatly to better 'The Queen Is Dead', it falls just short of its goals. With producer Stephen Street, the Smiths created a subtly shaded and skilled album, one boasting a fuller production than before. Morrissey and Marr also labored hard over the songs, working to expand the Smiths' sound within their very real boundaries. For the most part, they succeed. 'I Started Something I Couldn't Finish,' 'Girlfriend in a Coma,' 'Stop Me if You Think You've Heard This One Before,' and 'I Won't Share You' are classics, while 'A Rush and a Push and the Land Is Ours,' 'Death of a Disco Dancer,' and 'Last Night I Dreamt That Somebody Loved Me' aren't far behind. However, the songs also have a tendency to be glib and forced, particularly on 'Unhappy Birthday' and the anti-record company 'Paint a Vulgar Picture,' which has grown increasingly ironic in the wake of the Smiths' and Morrissey's love of repackaging the same material in new compilations. Still, Strangeways is a graceful way to bow out. While it doesn't match 'The Queen Is Dead' or 'The Smiths', it is far from embarrassing and offers a summation of the group's considerable strengths.' -- Stephen Thomas Erlewine",
    "img": "https://upload.wikimedia.org/wikipedia/en/3/37/Smiths_-_Strangeways_here_we_come.jpg",
    "spotifyLink": "https://open.spotify.com/album/7jfexk2w5aDI25njkN0UGg?si=NJV4k_HsQJKc8mO4lkoxIg",
    "appleMusicLink": "https://music.apple.com/us/album/strangeways-here-we-come/799980711"
  },
  {
    "title": "Rank",
    "yearRecorded": "1986",
    "releaseDate": "1988-09-05",
    "releaseYear": 1988,
    "lengthSeconds": 3356,
    "lengthMinutes": "55:56",
    "genre": "Alternative Rock",
    "albumType": "Live",
    "label": "Rough Trade Records",
    "ukChartPosition": 2,
    "ukGold": true,
    "ukPlatinum": false,
    "usGold": false,
    "songs": [
      "The Queen Is Dead", "Panic", "Vicar in a Tutu", "Ask", "His Latest Flame/Rusholme Ruffians (Medley)", "The Boy with the Thorn in His Side", "Rubber Ring/What She Said (Medley)", "Is It Really So Strange?", "Cemetry Gates", "London", "I Know It's Over", "The Draize Train", "Still Ill", "Bigmouth Strikes Again"
    ],
    "review": "'For many Smiths fans, 'Rank' is as close as they will get to a live performance from Morrissey, Johnny Marr, and company. Recorded live at The National Ballroom in London in October of 1986, roughly six months before they disbanded altogether, these 14 songs capture the Smiths performing in full-on rock-star mode. Though Grant Showbiz's production and engineering work consistently places Morrissey's voice too loud in respect to the rest of the band, the performance is suitably epic, hit-packed, and engrossing. Morrissey is in fine form, randomly trilling and squawking throughout, providing enough cocky banter and personality that the fact that he's nearly out of breath for half the performance doesn't put a damper on the festivities. Highlights abound: the opening shot of 'The Queen Is Dead' bristles with emotion and post-punk fury; 'Vicar in a Tutu' sees an energized Morrissey employing interesting, bizarre vocal inflections and a series of endearing growls; 'I Know It's Over is perhaps more harrowing and brittle here than anywhere else in the band's discography, as Morrissey surrenders to emotion while the soil falls over his head. It's hard to tell if Mike Joyce and Andy Rourke were having their best nights, since their contributions are buried deeper in the mix than would seem appropriate. Somehow, Johnny Marr's distinctive, manic jangle manages to escape the production and demand attention, especially on his solo creation 'The Draize Train.' Still, one has to wonder why 'The Draize Train' was included over such staples as 'How Soon Is Now,' 'I Want the One I Can't Have,' and the eight other songs that were recorded during the concert but not included on the album. Perhaps they weren't seen as worthy representations, but there is certainly additional time left available on the CD edition, where at least two or three more songs could have been added. It really would be interesting to see how the band tackled 'Meat Is Murder,' 'How Soon Is Now,' and 'There Is a Light That Never Goes Out' that night. Absolute completists might want to track down the bootleg recording ...The Bad Boy From a Good Family, which presents the National Ballroom concert in a more complete light. 'Rank' is an essential part of any Smiths fan's collection, and it's an enlightening live peek at a foursome who many deem the greatest band of the 1980s, and more than a few others deem the last great band period.' -- Tim DiGravina",
    "img": "https://upload.wikimedia.org/wikipedia/en/e/e1/SmithsRank.jpg",
    "spotifyLink": "https://open.spotify.com/album/06Ey2y54V4aGjP5EsovA2O?si=ozqLKcAwT920Pmr3wRODTg",
    "appleMusicLink": "https://music.apple.com/us/album/rank/799978884"
  },
  {
    "title": "Hatful of Hollow",
    "yearRecorded": "1983-1984",
    "releaseDate": "1984-11-02",
    "releaseYear": 1984,
    "lengthSeconds": 3371,
    "lengthMinutes": "56:11",
    "genre": "Alternative Rock",
    "albumType": "Compilation",
    "label": "Rough Trade Records",
    "ukChartPosition": 7,
    "ukGold": true,
    "ukPlatinum": true,
    "usGold": false,
    "songs": [
        "William, It Was Really Nothing", "What Difference Does It Make?", "These Things Take Time", "This Charming Man", "How Soon Is Now?", "Handsome Devil", "Hand In Glove", "Still Ill", "Heaven Knows I'm Miserable Now", "This Night Has Opened My Eyes", "You've Got Everything Now", "Accept Yourself", "Girl Afraid", "Back To The Old House", "Reel Around The Fountain", "Please Please Please Let Me Get What I Want"
    ],
    "review": "'Several months after releasing their first album, the Smiths issued the singles and rarities collection Hatful of Hollow, establishing a tradition of repackaging their material as many times and as quickly as possible. While several cuts on 'Hatful of Hollow' are BBC versions of songs from The Smiths, the versions on the compilation are nervy and raw -- and they're also not the selling point of the record. The Smiths treated singles as individual entities, not just ways to promote an album, and many of their finest songs were never issued on their studio albums. Hatful of Hollow contains many of these classics, including the sweet rush of 'William, It Was Really Nothing,' and the sardonic 'Heaven Knows I'm Miserable Now,' the tongue-in-cheek lament of 'Please, Please, Please Let Me Get What I Want,' the wistful 'Back to the Old House,' 'Girl Afraid,' and the pulsating, tremolo-laced masterpiece 'How Soon Is Now?' With such strong material forming the core of the album, it's little wonder that 'Hatful of Hollow' is as consistent as The Smiths and arguably captures the excitement surrounding the band even better.' -- Stephen Thomas Erlewine",
    "img": "https://upload.wikimedia.org/wikipedia/en/1/15/HatfulofHollow84.jpg",
    "spotifyLink": "https://open.spotify.com/album/1j57Q5ntVi7crpibb0h4sv?si=hgK8ZukMQvK60hG_zjpAnA",
    "appleMusicLink": "https://music.apple.com/us/album/hatful-of-hollow/799969670"
  },
  {
    "title": "The World Won't Listen",
    "yearRecorded": "1984-1986",
    "releaseDate": "1987-02-23",
    "releaseYear": 1987,
    "lengthSeconds": 3566,
    "lengthMinutes": "59:26",
    "genre": "Alternative Rock",
    "albumType": "Compilation",
    "label": "Rough Trade Records",
    "ukChartPosition": 2,
    "ukGold": true,
    "ukPlatinum": false,
    "usGold": false,
    "songs": [
        "Panic", "Ask", "London", "Bigmouth Strikes Again", "Shakespeare's Sister", "There Is a Light That Never Goes Out", "Shoplifters of the World Unite", "The Boy with the Thorn in His Side", "Money Changes Everything", "Asleep", "Unloveable", "Half a Person", "Stretch Out and Wait", "That Joke Isn't Funny Anymore", "Oscillate Wildly", "You Just Haven't Earned It Yet, Baby", "Rubber Ring"
    ],
    "review": "'In 1987, Rough Trade released two collections of singles and B-sides by the Smiths. The U.S. audience saw the release of 'Louder Than Bombs', which collected 24 assorted tracks. British fans were handed 'The World Won't Listen', with 16 tracks. Most ardent fans of the band obviously gobbled up both releases. The 13 shared tracks across the two albums are 'Panic,' 'Ask,' 'London,' 'Shakespeare's Sister,' 'Shoplifters of the World Unite,' 'Asleep,' 'Unloveable,' 'Half a Person,' 'Stretch Out and Wait,' 'Golden Lights,' 'Oscillate Wildly,' 'You Just Haven't Earned It Yet, Baby,' and 'Rubber Ring.' That means there are three tracks here that aren't included on 'Louder Than Bombs', and there are 11 tracks on 'Louder Than Bombs' that aren't included here. Going into the merits of the tracks isn't necessary; there's not a clunker to be found in the Smiths's discography. The funny, annoying, and/or incredible thing about both the Smiths and Morrissey is that so many songs (singles or B-sides) make appearances on so many different albums. Any die-hard fan of the Smiths is going to want or need both albums, just to have a complete collection of releases (not songs). Even then, there's going to be much repetition across the actual full-length albums and best-of collections. If an album called 'The Bombs Won't Listen' or 'Louder Than the World' was to be released tomorrow, there'd be an audience for it; granted, it would be a smaller audience than in the heyday of the Smiths. Many people consider the Morrissey/Marr duo to be the last great songwriting team; any release by the Smiths is indispensable to this audience. A casual fan in the U.S. might due well to simply pick up 'Louder Than Bombs', since The World Won't Listen's additional tracks ('Bigmouth Strikes Again,' 'There Is a Light That Never Goes Out,' 'The Boy With the Thorn in His Side,' and 'That Joke Isn't Funny Anymore') are all found on the major, full-length releases of the band, thus paying for the price of the import might not be justified.' -- Tim DiGravina",
    "img": "https://upload.wikimedia.org/wikipedia/en/8/85/TWWL.jpg",
    "spotifyLink": "https://open.spotify.com/album/2clbQSNocEJCzkuPPuc00q?si=sGqicKBmQk-UrDJ7yZ4Wdg",
    "appleMusicLink": "https://music.apple.com/us/album/the-world-wont-listen/802214888"
  },
  {
    "title": "Louder Than Bombs",
    "yearRecorded": "1983–1987",
    "releaseDate": "1987-03-30",
    "releaseYear": 1987,
    "lengthSeconds": 4364,
    "lengthMinutes": "72:44",
    "genre": "Alternative Rock",
    "albumType": "Compilation",
    "label": "Rough Trade Records",
    "ukChartPosition": 38,
    "ukGold": true,
    "ukPlatinum": false,
    "usGold": true,
    "songs": [
        "Is It Really So Strange?", "Sheila Take a Bow", "Shoplifters of the World Unite", "Sweet and Tender Hooligan", "Half a Person", "London", "Panic", "Girl Afraid", "Shakespeare's Sister", "William, It Was Really Nothing", "You Just Haven't Earned It Yet, Baby", "Heaven Knows I'm Miserable Now", "Ask", "Golden Lights", "Oscillate Wildly", "These Things Take Time", "Rubber Ring", "Back to the Old House", "Hand in Glove", "Stretch Out and Wait", "Please Please Please Let Me Get What I Want", "This Night Has Opened My Eyes", "Unloveable", "Asleep"
    ],
    "review": "'A compilation of singles, B-sides, album tracks, and BBC sessions assembled for the American market, 'Louder Than Bombs' is an overlong and unfocused collection that nevertheless boasts a wealth of brilliant material. Since 'Hatful of Hollow' was unavailable in the U.S. at the time of the release of 'Louder Than Bombs', this compilation contains large chunks of that album, as well as several cuts from The Smiths, which makes the record a little redundant for most Smiths fans. Also, 'Louder Than Bombs' contains some of the worst material the group ever recorded, including the bland instrumental 'Oscillate Wildly' and a cover of Twinkle's 'Golden Light.' Excluding all of this material, the remainder of the record is brilliant. The singles 'Shakespeare's Sister,' 'Panic,' 'Ask,' 'Shoplifters of the World Unite,' and 'Sheila Take a Bow' are all definitive, as are the elegiac 'Unloveable,' 'Asleep,' 'Stretch Out and Wait,' and 'Half a Person,' which are all unavailable anywhere else (excluding the British counterpart to Louder Than Bombs, The World Won't Listen). Furthermore, the sneering, bouncing pop of 'You Just Haven't Earned It Yet, Baby' and the bizarre travelogue of 'Is It Really So Strange?' are two other essential songs not available anywhere else. Though 'The World Won't Listen' is a more concise collection, 'Louder Than Bombs' is a necessary purchase for any Smiths fan.' -- Stephen Thomas Erlewine",
    "img": "https://upload.wikimedia.org/wikipedia/en/6/6a/LouderThanBombs.jpg",
    "spotifyLink": "https://open.spotify.com/album/45StnugV9WQMQwk4rRoTy8?si=r5X4lMmoTaOA-rQuEp1FZA",
    "appleMusicLink": "https://music.apple.com/us/album/louder-than-bombs/802231063"
  },
  {
    "title": "Best... I",
    "yearRecorded": "1983–1987",
    "releaseDate": "1992-08-17",
    "releaseYear": 1992,
    "lengthSeconds": 2709,
    "lengthMinutes": "45:09",
    "genre": "Alternative Rock",
    "albumType": "Compilation",
    "label": "WEA Records",
    "ukChartPosition": 1,
    "ukGold": true,
    "ukPlatinum": false,
    "usGold": false,
    "songs": ["This Charming Man", "William, It Was Really Nothing", "What Difference Does It Make?", "Stop Me If You Think You've Heard This One Before", "Girlfriend In A Coma", "Half A Person", "Rubber Ring", "How Soon Is Now?", "Hand In Glove", "Shoplifters Of The World Unite", "Sheila Take A Bow", "Some Girls Are Bigger Than Others", "Panic", "Please, Please, Please, Let Me Get What I Want"],
    "review": "'With or without its companion volume, this remains a...rather strange compilation. Even when viewed with Volume 2, these collections include odd selections at the expense of more obvious ones. The faithful will already have everything here...Neophyte fans would do better with 'Louder than Bombs' along with Queen and the debut, although this might come in handy as a supplement.' -- Steve Aldrich",
    "img": "https://upload.wikimedia.org/wikipedia/en/6/65/UKBest1.jpg",
    "spotifyLink": "https://open.spotify.com/artist/3yY2gUcIsjMr8hjo51PoJ8?si=H-waKZHuQHGMwaCH8IbywQ",
    "appleMusicLink": "https://music.apple.com/us/artist/the-smiths/829538"
  },
  {
    "title": "...Best II",
    "yearRecorded": "1983–1987",
    "releaseDate": "1992-11-02",
    "releaseYear": 1992,
    "lengthSeconds": 2709,
    "lengthMinutes": "52:24",
    "genre": "Alternative Rock",
    "albumType": "Compilation",
    "label": "WEA Records",
    "ukChartPosition": 29,
    "ukGold": true,
    "ukPlatinum": false,
    "usGold": false,
    "songs": ["The Boy with the Thorn in His Side", "The Headmaster Ritual", "Heaven Knows I'm Miserable Now", "Ask", "Oscillate Wildly", "Nowhere Fast", "Still Ill", "Bigmouth Strikes Again", "That Joke Isn't Funny Anymore", "Shakespeare's Sister", "Girl Afraid", "Reel Around the Fountain", "Last Night I Dreamt That Somebody Loved Me", "There Is a Light That Never Goes Out"],
    "review": "'Picking up where the first volume left off, 'Best, Vol. 2' does contain some of the Smiths very best songs -- 'The Boy With the Thorn in His Side,' 'Heaven Knows I'm Miserable Now,' 'Bigmouth Strikes Again,' 'Reel Around the Fountain,' 'There Is a Light That Never Goes Out,' among others. Even so, it doesn't work as its own record since it deliberately complements the first volume, which itself wasn't a great overview of the Smiths' best. Since these two comps were released, better collections like 'Singles' and 'The Very Best of the Smiths' have been released, supplanting these two botched efforts.' -- Stephen Thomas Erlewine",
    "img": "https://upload.wikimedia.org/wikipedia/en/3/33/UKBest2.JPG",
    "spotifyLink": "https://open.spotify.com/artist/3yY2gUcIsjMr8hjo51PoJ8?si=H-waKZHuQHGMwaCH8IbywQ",
    "appleMusicLink": "https://music.apple.com/us/artist/the-smiths/829538"
  },
  {
    "title": "Singles",
    "yearRecorded": "1983–1987",
    "releaseDate": "1995-02-20",
    "releaseYear": 1995,
    "lengthSeconds": 3752,
    "lengthMinutes": "62:32",
    "genre": "Alternative Rock",
    "albumType": "Compilation",
    "label": "WEA Records",
    "ukChartPosition": 5,
    "ukGold": true,
    "ukPlatinum": true,
    "usGold": false,
    "songs": ["Hand in Glove", "This Charming Man", "What Difference Does It Make?", "Heaven Knows I'm Miserable Now", "William, It Was Really Nothing", "How Soon Is Now?", "Shakespeare's Sister", "That Joke Isn't Funny Anymore", "The Boy with the Thorn in His Side", "Bigmouth Strikes Again", "Panic", "Ask", "Shoplifters of the World Unite", "Sheila Take a Bow", "Girlfriend in a Coma", "I Started Something I Couldn't Finish", "Last Night I Dreamt That Somebody Loved Me", "There Is a Light That Never Goes Out"],
    "review": "''The Best of the Smiths' collections didn't work because they didn't have a sense of history and distorted the underlying sense of urgency that helped make the Smiths important. Singles simply collects all of the singles from one of the greatest singles bands since the Beatles. It's essential and influential guitar pop, presented in a way that makes sense and is endlessly listenable.' -- Stephen Thomas Erlewine",
    "img": "https://upload.wikimedia.org/wikipedia/en/4/4b/SmithsSingles.jpg",
    "spotifyLink": "https://open.spotify.com/artist/3yY2gUcIsjMr8hjo51PoJ8?si=H-waKZHuQHGMwaCH8IbywQ",
    "appleMusicLink": "https://music.apple.com/us/artist/the-smiths/829538"
  },
  {
    "title": "The Very Best of The Smiths",
    "yearRecorded": "1983–1987",
    "releaseDate": "2001-06-04",
    "releaseYear": 2001,
    "lengthSeconds": 4714,
    "lengthMinutes": "78:34",
    "genre": "Alternative Rock",
    "albumType": "Compilation",
    "label": "WEA Records",
    "ukChartPosition": 30,
    "ukGold": true,
    "ukPlatinum": true,
    "usGold": false,
    "songs": ["Panic", "The Boy with the Thorn in His Side", "Heaven Knows I'm Miserable Now", "Ask", "Bigmouth Strikes Again", "How Soon Is Now?", "This Charming Man", "What Difference Does It Make?", "William, It Was Really Nothing", "Some Girls Are Bigger Than Others", "Girlfriend in a Coma", "Hand in Glove", "There Is a Light That Never Goes Out", "Please, Please, Please, Let Me Get What I Want", "That Joke Isn't Funny Anymore", "I Know It's Over", "Sheila Take a Bow", "I Started Something I Couldn't Finish", "Still Ill", "Shakespeare's Sister", "Shoplifters of the World Unite", "Last Night I Dreamt That Somebody Loved Me", "Stop Me If You Think You've Heard This One Before"],
    "review": "'There is absolutely no reason to own 'The Very Best of the Smiths' if you already own all the Smiths albums. There is little reason to own this if you own the Singles collection. If you don't have any Smiths in your collection, 'Singles' still makes a better bet because that has a logical theme and chronological sequencing. But, if you're just looking for 23 songs that do represent much of the Smiths' best work, 2001's 'The Very Best of the Smiths' will do, since it does contain all the group's anthems, without a misstep (outside of that doggedly unchronological sequencing). That still doesn't make it a welcome addition to the canon, particularly since it's saddled with an ugly faux-Smiths cover, but it's better than the first two posthumous Best Of collections, and it will give many casual fans what they think they want, even if it doesn't given them what they truly need.' -- Stephen Thomas Erlewine",
    "img": "https://upload.wikimedia.org/wikipedia/en/e/ed/SmithsVeryBest.jpg",
    "spotifyLink": "https://open.spotify.com/artist/3yY2gUcIsjMr8hjo51PoJ8?si=H-waKZHuQHGMwaCH8IbywQ",
    "appleMusicLink": "https://music.apple.com/us/artist/the-smiths/829538"
  },
  {
    "title": "The Sound of The Smiths",
    "yearRecorded": "1983–1987",
    "releaseDate": "2008-11-10",
    "releaseYear": 2008,
    "lengthSeconds": 4585,
    "lengthMinutes": "76:41",
    "genre": "Alternative Rock",
    "albumType": "Compilation",
    "label": "WEA Records",
    "ukChartPosition": 21,
    "ukGold": true,
    "ukPlatinum": true,
    "usGold": false,
    "songs": ["Hand In Glove", "This Charming Man", "What Difference Does It Make", "Still Ill", "Heaven Knows I'm Miserable Now", "William, It Was Really Nothing", "How Soon Is Now? (12'' Version)",	"Nowhere Fast", "Shakespeare's Sister", "Barbarism Begins At Home (7'' Version)", "That Joke Isn't Funny Anymore", "The Headmaster Ritual", "The Boy With The Thorn In His Side", "Bigmouth Strikes Again", "There Is A Light That Never Goes Out", "Panic", "Ask", "You Just Haven't Earned It Yet, Baby", "Shoplifters Of The World Unite", "Sheila Take A Bow", "Girlfriend In A Coma", "I Started Something I Couldn't Finish", "Last Night I Dreamt That Somebody Loved Me"],
    "review": "'Depending on your count, 'The Sound of the Smiths' is the third or fourth posthumous Smiths compilation -- a number that may be a bit excessive considering the group's rather concise catalog, containing just four studio albums and singles rounded up on three singles compilations (and two of those covered the same essential territory, too). That's a lot of repetition but whether it's taken in either its single-disc or double-disc deluxe editions, 'The Sound of the Smiths' is the best of these posthumous overviews. The single-disc -- which is the first disc of the deluxe set -- is the hits disc, containing every cut from the 18-track 1995 compilation 'Singles' and expanding it with five cuts all dating from the mid-'80s: 'Still Ill,' 'Nowhere Fast,' 'Barbarism Begins at Home,' 'The Headmaster Ritual,' and 'You Just Haven't Earned It Yet Baby.' As a Smiths-basics goes, it's first-rate, an introduction and summary that's compulsively listenable. The second disc on the deluxe 'The Sound of the Smiths' splits the difference between a rarities compilation and a 'more of the best' collection of album tracks, rounding up non-LP singles and B-sides like 'Jeane,' 'Wonderful Woman,' 'Money Changes Everything,' and the New York Vocal version of 'This Charming Man,' live versions of 'Handsome Devil,' 'Meat Is Murder,' 'What's the World?' and 'London,' the Troy Tate demo of 'Pretty Girls Make Graves,' and a bunch of great Smiths songs including a hefty chunk of 'The Queen Is Dead'. It falls short of being the long-awaited collection of Smiths rarities, the absence of which remains a mystery, but it's the best stab at one to date and a pretty entertaining listen in its own right.' -- Stephen Thomas Erlewine",
    "img": "https://upload.wikimedia.org/wikipedia/en/6/65/SmithsSoundOf.jpg",
    "spotifyLink": "https://open.spotify.com/album/65IUZfizoxnc0WHnhEZjf3?si=S8Ub5fRPQtOpWUprixEXlw",
    "appleMusicLink": "https://music.apple.com/us/album/the-sound-of-the-smiths-deluxe/800217913"
  },
  {
    "title": "The Smiths Singles Box",
    "yearRecorded": "1983–1987",
    "releaseDate": "2008-12-08",
    "releaseYear": 2008,
    "lengthSeconds": 5084,
    "lengthMinutes": "84:44",
    "genre": "Alternative Rock",
    "albumType": "Compilation",
    "label": "WEA Records",
    "ukChartPosition": 21,
    "ukGold": false,
    "ukPlatinum": false,
    "usGold": false,
    "songs": ["Hand in Glove", "Handsome Devil (Live)", "This Charming Man (Manchester)", "This Charming Man (London)", "Accept Yourself", "Wonderful Woman", "Jeane", "This Charming Man (New York Vocal)", "This Charming Man (New York Instrumental)", "What Difference Does It Make?", "Back to the Old House", "These Things Take Time", "Heaven Knows I'm Miserable Now", "Girl Afraid", "Suffer Little Children", "William, It Was Really Nothing", "How Soon Is Now?", "Please, Please, Please, Let Me Get What I Want", "How Soon Is Now?", "Well I Wonder", "Oscillate Wildly", "Shakespeare's Sister", "What She Said", "Stretch Out and Wait", "Barbarism Begins at Home", "Shakespeare's Sister", "Stretch Out and Wait", "That Joke Isn't Funny Anymore", "Nowhere Fast (Live)", "Stretch Out and Wait (Live)", "Shakespeare's Sister (Live)", "Meat Is Murder (Live)", "The Boy with the Thorn in His Side", "Rubber Ring", "Asleep", "Bigmouth Strikes Again", "Money Changes Everything", "Unloveable"
    ],
    "review": "",
    "img": "https://upload.wikimedia.org/wikipedia/en/f/f9/The_Smiths_Singles_Box_cover.jpg",
    "spotifyLink": "https://open.spotify.com/artist/3yY2gUcIsjMr8hjo51PoJ8?si=H-waKZHuQHGMwaCH8IbywQ",
    "appleMusicLink": "https://music.apple.com/us/artist/the-smiths/829538"
  },
  {
    "title": "Complete",
    "yearRecorded": "1983–1987",
    "releaseDate": "2011-09-26",
    "releaseYear": 2011,
    "lengthSeconds": 24278,
    "lengthMinutes": "404:38",
    "genre": "Alternative Rock",
    "albumType": "Compilation",
    "label": "Rhino Records",
    "ukChartPosition": 63,
    "ukGold": false,
    "ukPlatinum": false,
    "usGold": false,
    "songs": ["Reel Around The Fountain", "You've Got Everything Now", "Miserable Lie", "Pretty Girls Make Graves", "The Hand That Rocks The Cradle", "This Charming Man", "Still Ill", "Hand In Glove", "What Difference Does It Make?", "I Don't Owe You Anything", "Suffer Little Children", "The Headmaster Ritual", "Rusholme Ruffians", "I Want The One I Can't Have", "What She Said", "That Joke Isn't Funny Anymore", "Nowhere Fast", "Well I Wonder", "Barbarism Begins At Home", "Meat Is Murder", "The Queen Is Dead", "Frankly, Mr. Shankly", "I Know It's Over", "Never Had No One Ever", "Cemetry Gates", "Bigmouth Strikes Again", "The Boy With The Thorn In His Side", "Vicar In A Tutu", "There Is A Light That Never Goes Out", "Some Girls Are Bigger Than Others", "A Rush And A Push And The Land Is Ours", "I Started Something I Couldn't Finish", "Death Of A Disco Dancer", "Girlfriend In A Coma", "Stop Me If You Think You've Heard This One Before", "Last Night I Dreamt That Somebody Loved Me", "Unhappy Birthday", "Paint A Vulgar Picture", "Death At One's Elbow", "I Won't Share You", "The Queen Is Dead", "Panic", "Vicar in a Tutu", "Ask", "His Latest Flame/Rusholme Ruffians (Medley)", "The Boy with the Thorn in His Side", "Rubber Ring/What She Said (Medley)", "Is It Really So Strange?", "Cemetry Gates", "London", "I Know It's Over", "The Draize Train", "Still Ill", "Bigmouth Strikes Again", "William, It Was Really Nothing", "What Difference Does It Make?", "These Things Take Time", "This Charming Man", "How Soon Is Now?", "Handsome Devil", "Hand In Glove", "Still Ill", "Heaven Knows I'm Miserable Now", "This Night Has Opened My Eyes", "You've Got Everything Now", "Accept Yourself", "Girl Afraid", "Back To The Old House", "Reel Around The Fountain", "Please Please Please Let Me Get What I Want", "Panic", "Ask", "London", "Bigmouth Strikes Again", "Shakespeare's Sister", "There Is a Light That Never Goes Out", "Shoplifters of the World Unite", "The Boy with the Thorn in His Side", "Money Changes Everything", "Asleep", "Unloveable", "Half a Person", "Stretch Out and Wait", "That Joke Isn't Funny Anymore", "Oscillate Wildly", "You Just Haven't Earned It Yet, Baby", "Rubber Ring", "Golden Lights", "Is It Really So Strange?", "Sheila Take a Bow", "Shoplifters of the World Unite", "Sweet and Tender Hooligan", "Half a Person", "London", "Panic", "Girl Afraid", "Shakespeare's Sister", "William, It Was Really Nothing", "You Just Haven't Earned It Yet, Baby", "Heaven Knows I'm Miserable Now", "Ask", "Golden Lights", "Oscillate Wildly", "These Things Take Time", "Rubber Ring", "Back to the Old House", "Hand in Glove", "Stretch Out and Wait", "Please Please Please Let Me Get What I Want", "This Night Has Opened My Eyes", "Unloveable", "Asleep"
    ],
    "review": "'First off, no, this box set doesn't contain the Complete Smiths, not even in its super-deluxe edition containing vinyl replicas of the group's singles and LPs. Stray B-sides don't appear here, nor do the scrapped sessions for the first album and a few other heavily bootlegged numbers, but what is here are sterling remasters -- allegedly supervised by Johnny Marr -- of the band's four albums, three compilations, and lone live album, all released during the band's exceedingly brief lifespan. What matters is that the remastering is exceptional, the best comparison being the Beatles 2009 remasters, where layers of grime seemed to be removed from familiar recordings, so the songs sounded vibrant and alive, yet didn't sound tweaked, buttressed, or burnished for a new millennium. That is what makes 'The Complete Smiths' essential: no surprises in terms of material, but the presentation is exquisite, sounding familiar and fresh, a stunning re-presentation of records that were teetering on the edge of over-familiarity. Guitars and vocals pop equally, the original mixes simply brightened, a task harder to achieve than it is to imagine, the music sounding part of its time yet easily transcending it. Far from a vulgar picture, this is what Smiths fans have been waiting years for.' -- Stephen Thomas Erlewine",
    "img": "https://upload.wikimedia.org/wikipedia/en/5/55/The_Smiths_-_Complete_cover_art.jpg",
    "spotifyLink": "https://open.spotify.com/album/30g571JKoxs8AnsgAViV2J?si=gE5q03lsSsGaQmTztlAAvg",
    "appleMusicLink": "https://music.apple.com/us/album/complete/803459952"
  }
]  